       01  RECNAME.
           05 FLD1             PIC X(3).
           05 FLD2             PIC X(5) OCCURS 3.
           05 FLD3             OCCURS 2.
              10 FLD3A         PIC X(2).
              10 FLD3B         PIC X(3).
           05 FLD4             PIC X(5).